In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\udaya\OneDrive\Desktop\ML_algos\salaries.csv")
df.head(10)

      company                  job     degree  salary_more_then_100k
0      google      sales executive  bachelors                      0
1      google      sales executive    masters                      0
2      google     business manager  bachelors                      1
3      google     business manager    masters                      1
4      google  computer programmer  bachelors                      0
5      google  computer programmer    masters                      1
6  abc pharma      sales executive    masters                      0
7  abc pharma  computer programmer  bachelors                      0
8  abc pharma     business manager  bachelors                      0
9  abc pharma     business manager    masters                      1

In [4]:
inputs=df.drop("salary_more_then_100k",axis="columns")
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [6]:
target=df["salary_more_then_100k"]
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [7]:
#label encoding

In [9]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_degree = LabelEncoder()
le_job = LabelEncoder()

In [10]:
inputs['company_n']=le_company.fit_transform(inputs["company"])
inputs['job_n']=le_job.fit_transform(inputs["job"])
inputs['degree_n']=le_degree.fit_transform(inputs["degree"])

In [11]:
inputs.head(7)

      company                  job     degree  company_n  job_n  degree_n
0      google      sales executive  bachelors          2      2         0
1      google      sales executive    masters          2      2         1
2      google     business manager  bachelors          2      0         0
3      google     business manager    masters          2      0         1
4      google  computer programmer  bachelors          2      1         0
5      google  computer programmer    masters          2      1         1
6  abc pharma      sales executive    masters          0      2         1

In [12]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns')

In [13]:
inputs_n.head(5)

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1
2          2      0         0
3          2      0         1
4          2      1         0

In [14]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [15]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [16]:
model.score(inputs_n,target)

1.0

In [17]:
# model.predict([[google,cs programer,bachlor]])

model.predict([[2,1,0]])

#not more than 100k

array([0], dtype=int64)

In [19]:
# model.predict([[google,cs programer,master]])

model.predict([[2,1,1]])

# more than 100k

array([1], dtype=int64)